cf/DataProcessors/ElectronicDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>ElectronicDocuments</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/EDEventsLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>EDEventsLog</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>EDOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EDStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteEDStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>AttachedFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RecNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/BankApplications.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>BankApplications</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AlphaBankOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SberbankOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExchangeThroughTheAdditionalInformationProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AsynchronousExchange</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iBank2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/EDKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>EDKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AcceptanceCertificate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActPerformer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RightsDelegationAct</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProductsReturnBetweenCompanies</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BankStatement</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AddData</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProductOrder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QueryStatement</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QueryProbe</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDReturnQuery</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QueryNightStatements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDStateQuery</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationAboutReception</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationOnStatusOfED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProductsDirectory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>STATEMENT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CorrectiveInvoiceNote</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ResponseToOrder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ComissionGoodsSalesReport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ComissionGoodsWriteOffReport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoodsTransferBetweenCompanies</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PaymentOrder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Confirmation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PriceList</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RandomED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AgreementAboutCostChangeSender</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AgreementAboutCostChangeRecipient</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoiceForPayment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerInvoiceNote</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TORG12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TORG12Customer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TORG12Seller</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationAboutClarification</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOffer</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/EDDirections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>EDDirections</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Incoming</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Intercompany</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Outgoing</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/EDStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>EDStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Canceled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Delivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationDelivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Executed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CardFile2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotFormed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Processed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RefusedABC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Rejected</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RejectedByBank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RejectedByReceiver</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdviseSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOfferSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AttributesError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferedToOperator</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PreparedToSending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationPrepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationPrepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Confirmed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DigitallySigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FullyDigitallySigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Received</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceivedOperatorConfirmation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOfferReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AnnouncementReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Accepted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Suspended</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOfferCreated</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Approved</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PartlyDigitallySigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ESNotCorrect</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/ElectronicDocuments/Forms/EDList/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// GENERAL PURPOSE PROCEDURES AND FUNCTIONS

&AtServer
Procedure UpdateEDDependenciesTree()
	
	SetPrivilegedMode(True);
	
	ExchangeSettings = ElectronicDocumentsService.DetermineEDExchangeSettingsBySource(ObjectRef, False);
	If Not ValueIsFilled(ExchangeSettings) Then
		SignatureRequired = False;
	Else
		SignatureRequired = ExchangeSettings.ToSign;
		EDFSetup = ExchangeSettings.EDAgreement;
		
		If ValueIsFilled(EDFSetup)
			AND CommonUse.ObjectAttributeValue(EDFSetup, "BankApplication") = Enums.BankApplications.AsynchronousExchange Then
			Items.SynchronizeWithBank.Visible = True;
		EndIf;
	EndIf;
	
	GenerateTreesED();
	DisplayTableDocument();
	
EndProcedure

&AtServer
Procedure GenerateTreesED()
	
	TreeSubordinateED.GetItems().Clear();
	OutputSubordinateDocuments(ObjectRef, TreeSubordinateED);
	
EndProcedure

&AtServer
Function GetSelectionByDocumentAttributes(ObjectReference)
	
	ObjectMetadata = ObjectReference.Metadata();
	
	If TypeOf(ObjectReference) = Type("CatalogRef.EDUsageAgreements") Then
		QueryText = 
		"SELECT ALLOWED
		|	Ref,
		|	False AS Posted,
		|	DeletionMark,
		|	Presentation
		|FROM
		|	Catalog." + ObjectMetadata.Name + "
		|WHERE
		|	Refs = &Refs
		|";
	Else
		QueryText = 
		"SELECT ALLOWED
		|	Ref,
		|	Posted,
		|	DeletionMark,
		|	Presentation
		|FROM
		|	Document." + ObjectMetadata.Name + "
		|WHERE
		|	Refs = &Refs
		|";
	EndIf;
	
	Query = New Query(QueryText);
	Query.SetParameter("Ref", ObjectReference);
	Return Query.Execute().Select();
	
EndFunction

&AtServer
Function GetEDListByOwner(OwnerObject)
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	AttachedFiles.Ref
	|FROM
	|	Catalog.EDAttachedFiles AS AttachedFiles
	|WHERE
	|	AttachedFiles.FileOwner = &OwnerObject";
	Query.SetParameter("OwnerObject", OwnerObject);
	
	Return Query.Execute().Unload();
	
EndFunction

&AtServer
Procedure OutputSubordinateDocuments(CurrentDocument, ParentalTree)
	
	TreeRows = ParentalTree.GetItems();
	Table      = GetEDListByOwner(CurrentDocument);
	If Table = Undefined Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	AttachedFiles.Ref,
	|	AttachedFiles.EDStatus,
	|	AttachedFiles.EDVersionNumber,
	|	AttachedFiles.EDStatusChangeDate,
	|	AttachedFiles.EDDirection,
	|	AttachedFiles.Presentation,
	|	AttachedFiles.DeletionMark,
	|	CASE
	|		WHEN SlaveBoundFiles.Ref IS NULL 
	|			THEN FALSE
	|		ELSE TRUE
	|	END AS ExistenceOfSubordinateDocuments,
	|	AttachedFiles.FileOwner.Date AS OwnerDate,
	|	AttachedFiles.FileOwner.Number AS OwnerNumber,
	|	AttachedFiles.EDKind
	|FROM
	|	Catalog.EDAttachedFiles AS AttachedFiles
	|		LEFT JOIN Catalog.EDAttachedFiles AS SlaveBoundFiles
	|		ON (SlaveBoundFiles.ElectronicDocumentOwner = AttachedFiles.Ref)
	|WHERE
	|	(AttachedFiles.FileOwner = &OwnerObject
	|			OR AttachedFiles.ElectronicDocumentOwner = &OwnerObject)
	|	AND Not AttachedFiles.EDKind = VALUE(Enum.EDKinds.AddData)
	|
	|ORDER BY
	|	AttachedFiles.CreationDate";
	Query.SetParameter("OwnerObject", CurrentDocument);
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		ObjectTree = FormAttributeToValue("TreeSubordinateED");
		If ObjectTree.Rows.Find(Selection.Ref, , True) = Undefined Then
			NewRow = TreeRows.Add();
			FillPropertyValues(NewRow, Selection,
				"Ref, EDStatus, EDStatusChangeDate, EDDirection, Presentation, DeletionMark");
			If ValueIsFilled(Selection.OwnerDate) AND ValueIsFilled(Selection.OwnerNumber) Then
				ParametersStructure = New Structure;
				ParametersStructure.Insert("OwnerNumber", Selection.OwnerNumber);
				ParametersStructure.Insert("OwnerDate",  Selection.OwnerDate);
				ParametersStructure.Insert("EDVersion",       Selection.EDVersionNumber);
				NewRow.Presentation = ElectronicDocumentsService.DetermineEDPresentation(Selection.EDKind, ParametersStructure);
			EndIf;
			If Selection.ExistenceOfSubordinateDocuments Then
				OutputSubordinateDocuments(Selection.Ref, NewRow);
			EndIf;
			
		EndIf;
	EndDo;
	
EndProcedure

&AtServer
Procedure DisplayTableDocument()
	
	ReportTable.Clear();
	
	Template = DataProcessors.ElectronicDocuments.GetTemplate("ED_List");
	
	PutCurrentDocument(Template);
	DisplaySubordinatedTreeNodes(TreeSubordinateED.GetItems(), Template, 1)
	
EndProcedure

&AtServer
Procedure DisplayDocumentAndPicture(TreeRow, Template, IsCurrentDocument = False, IsSubordinated = Undefined)
	
	If IsCurrentDocument Then
		If TreeRow.Posted Then
			If IsSubordinated = Undefined  Then
				If TreeSubordinateED.GetItems().Count() AND ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorTopBottom");
				ElsIf TreeSubordinateED.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorBottom");
				ElsIf ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorTop");
				Else
					AreaPicture = Template.GetArea("DocumentPostedConnectorTop");
				EndIf;
			ElsIf IsSubordinated = True Then
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorLeftBottom");
				Else
					AreaPicture = Template.GetArea("DocumentHeld");
				EndIf;
			Else
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorLeftTop");
				Else
					AreaPicture = Template.GetArea("DocumentHeld");
				EndIf;
			EndIf;
		ElsIf TreeRow.DeletionMark Then
			If IsSubordinated = Undefined Then
				If TreeSubordinateED.GetItems().Count() AND ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorTopBottom");
				ElsIf TreeSubordinateED.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorBottom");
				ElsIf ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorTop");
				Else
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorTop");
				EndIf;
			ElsIf IsSubordinated = True Then
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorLeftBottom");
				Else
					AreaPicture = Template.GetArea("DocumentIsMarkedForDeletion");
				EndIf;
			Else
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorLeftTop");
				Else
					AreaPicture = Template.GetArea("DocumentIsMarkedForDeletion");
				EndIf;
			EndIf;
		Else
			If TreeRow.Ref = ObjectRef Then
				If TreeSubordinateED.GetItems().Count() AND ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorTopBottom");
				ElsIf TreeSubordinateED.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorDown");
				ElsIf ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorTop");
				Else
					AreaPicture = Template.GetArea("DocumentWrittenConnectorTop");
				EndIf;
			ElsIf IsSubordinated = True Then
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorLeftBottom");
				Else
					AreaPicture = Template.GetArea("DocumentRecorded");
				EndIf;
			Else
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorLeftTop");
				Else	
					AreaPicture = Template.GetArea("DocumentRecorded");
				EndIf;
			EndIf;
		EndIf;
		ReportTable.Put(AreaPicture);
	Else
		If TreeRow.DeletionMark Then
			If IsSubordinated = Undefined Then
				If TreeSubordinateED.GetItems().Count() AND ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorTopBottom");
				ElsIf TreeSubordinateED.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorBottom");
				ElsIf ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorTop");
				Else
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorTop");
				EndIf;
			ElsIf IsSubordinated = True Then
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorLeftBottom");
				Else
					AreaPicture = Template.GetArea("DocumentIsMarkedForDeletion");
				EndIf;
			Else
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentMarkedForDeletionConnectorLeftTop");
				Else
					AreaPicture = Template.GetArea("DocumentIsMarkedForDeletion");
				EndIf;
			EndIf;
			
		ElsIf TreeRow.EDDirection = Enums.EDDirections.Incoming
			AND (SignatureRequired AND TreeRow.EDStatus = Enums.EDStatuses.ConfirmationDelivered
			OR Not SignatureRequired AND (TreeRow.EDStatus = Enums.EDStatuses.Approved
			OR TreeRow.EDStatus = Enums.EDStatuses.AdviseSent))
			OR TreeRow.EDDirection = Enums.EDDirections.Outgoing
			AND (SignatureRequired AND (TreeRow.EDStatus = Enums.EDStatuses.ConfirmationReceived
			OR TreeRow.EDStatus = Enums.EDStatuses.Delivered)
			OR Not SignatureRequired AND TreeRow.EDStatus = Enums.EDStatuses.Delivered)
			OR TreeRow.EDDirection = Enums.EDDirections.Intercompany
			AND SignatureRequired AND TreeRow.EDStatus = Enums.EDStatuses.FullyDigitallySigned Then
			If IsSubordinated = Undefined Then
				If TreeSubordinateED.GetItems().Count() AND ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorTopBottom");
				ElsIf TreeSubordinateED.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorBottom");
				ElsIf ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorTop");
				Else
					AreaPicture = Template.GetArea("DocumentPostedConnectorTop");
				EndIf;
			ElsIf IsSubordinated = True Then
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorLeftBottom");
				Else
					AreaPicture = Template.GetArea("DocumentHeld");
				EndIf;
			Else
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentPostedConnectorLeftTop");
				Else
					AreaPicture = Template.GetArea("DocumentHeld");
				EndIf;
			EndIf;
		Else
			If TreeRow.Ref = ObjectRef Then
				If TreeSubordinateED.GetItems().Count() AND ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorTopBottom");
				ElsIf TreeSubordinateED.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorDown");
				ElsIf ParentalEDTree.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorTop");
				Else
					AreaPicture = Template.GetArea("DocumentWrittenConnectorTop");
				EndIf;
			ElsIf IsSubordinated = True Then
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorLeftBottom");
				Else	
					AreaPicture = Template.GetArea("DocumentRecorded");
				EndIf;
			Else
				If TreeRow.GetItems().Count() Then
					AreaPicture = Template.GetArea("DocumentWrittenConnectorLeftTop");
				Else
					AreaPicture = Template.GetArea("DocumentRecorded");
				EndIf;
			EndIf;
		EndIf;
		ReportTable.Join(AreaPicture);
	EndIf;
	
	AreaDocument = Template.GetArea(?(IsCurrentDocument,"CurrentDocument", "Document"));
	If IsCurrentDocument Then
		AreaDocument.Parameters.DocumentPresentation = GetDocumentPresentationToPrint(TreeRow);
	Else
		AreaDocument.Parameters.DocumentPresentation = GetEDPresentation(TreeRow);
	EndIf;
	AreaDocument.Parameters.Document = TreeRow.Ref;
	ReportTable.Join(AreaDocument);
	
EndProcedure

&AtServer
Function NeedToDisplayVerticalConnector(LevelUp, TreeRow, LookAmongSubordinates = True)
	
	CurrentRow = TreeRow;
	
	For ind=1 To LevelUp Do
		CurrentRow = CurrentRow.GetParent();
		If ind = LevelUp Then
			ParentToFind = CurrentRow;
		ElsIf ind = (LevelUp-1) Then
			RowToFind = CurrentRow;
		EndIf;
	EndDo;
	
	If ParentToFind = Undefined Then
		If LookAmongSubordinates Then
			ParentSubordinateNodes = TreeSubordinateED.GetItems();
		Else
			ParentSubordinateNodes = ParentalEDTree.GetItems();
		EndIf;
	Else
		ParentSubordinateNodes =  ParentToFind.GetItems();
	EndIf;
	
	Return ParentSubordinateNodes.IndexOf(RowToFind) < (ParentSubordinateNodes.Count()-1);
	
EndFunction

// Displays in the tabular document the row with the document for which the subordination structure is formed
//
// Parameters
// Template - TemplateTableDocument - template on the basis of which the tabular document is formed.
&AtServer
Procedure PutCurrentDocument(Template)
	
	Selection = GetSelectionByDocumentAttributes(ObjectRef);
	If Selection.Next() Then
		DisplayDocumentAndPicture(Selection, Template, True);
	EndIf;
	
EndProcedure

// It forms the document presentation for output to tabular document
//
// Parameters
// Selection  - QueryResultSelection or FormDataTreeItem - Dataset
//              on the basis of which presentation is formed
//
// Returns:
// String   - generated presentation.
//
&AtServer
Function GetDocumentPresentationToPrint(Selection)
	
	DocumentPresentation = Selection.Presentation;
	
	Return DocumentPresentation;
	
EndFunction

&AtServer
Function GetEDPresentation(Selection)
	
	DocumentPresentation = Selection.Presentation;
	DocumentPresentation = DocumentPresentation + " <" +  Selection.EDStatus + ", "
		+ Format(Selection.EDStatusChangeDate, "DLF=") + ">";
	
	Return DocumentPresentation;
	
EndFunction

// It displays the tree rows of subordinate documents
//
// Parameters
// TreeRows - FormDataTreeItemCollection - tree
//            rows that are output to the tabular document
// Template - TemplateTableDocument - template on
//            the basis of which the data is output to the tabular document
// RecursionLevel  - Number - recursion procedure level
//
&AtServer
Procedure DisplaySubordinatedTreeNodes(TreeRows, Template, RecursionLevel)
	
	For Each TreeRow IN TreeRows Do
		
		IsCurrentObject  = (TreeRow.Ref = ObjectRef);
		IsInitialObject = (TreeRow.Ref = InitialObject);
		SubordinatedTreeNodes = TreeRow.GetItems();
		
		For ind = 1 To RecursionLevel Do
			If RecursionLevel > ind Then
				
				If NeedToDisplayVerticalConnector(RecursionLevel - ind + 1,TreeRow) Then
					Area = Template.GetArea("ConnectorTopBottom");
				Else
					Area = Template.GetArea("Indent");
					
				EndIf;
			Else 
				
				If TreeRows.Count() > 1 AND (TreeRows.IndexOf(TreeRow)<> (TreeRows.Count()-1)) Then
					Area = Template.GetArea("ConnectorTopRightBottom");
				Else
					Area = Template.GetArea("ConnectorTopRight");
				EndIf;
				
			EndIf;
			
			Area.Parameters.Document = ?(IsInitialObject,Undefined,TreeRow.Ref);
			
			If ind = 1 Then
				ReportTable.Put(Area);
			Else
				ReportTable.Join(Area);
			EndIf;
			
		EndDo;
		
		DisplayDocumentAndPicture(TreeRow,Template,False,True);
		
		// Subordinate tree items output
		DisplaySubordinatedTreeNodes(SubordinatedTreeNodes,Template,RecursionLevel + 1);
		
	EndDo; 
	
EndProcedure

&AtClient
Procedure DisplayEDDependencies()
	
	UpdateEDDependenciesTree();
	ReportTable.Show();
	
EndProcedure

&AtServerNoContext
Function EDFSettingAttributes(Val EDFSetup)
	
	Return CommonUse.ObjectAttributesValues(EDFSetup, "Company, Counterparty");
	
EndFunction

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - Form commands actions

&AtClient
Procedure Refresh(Command)
	
	DisplayEDDependencies();
	ReportTable.Show();
	
EndProcedure

&AtClient
Procedure EventLogMonitor(Command)
	
	FormParameters = New Structure;
	
	Filter = New Structure;
	Filter.Insert("EDOwner", ObjectRef);
	
	FormParameters.Insert("Filter", Filter);
	FormParameters.Insert("WindowOpeningMode", FormWindowOpeningMode.LockOwnerWindow);
	OpenForm("InformationRegister.EDEventsLog.ListForm", FormParameters, ThisObject);
	
EndProcedure

&AtClient
Procedure SynchronizeWithBank(Command)
	
	EDFSettingAttributes = EDFSettingAttributes(EDFSetup);
	ElectronicDocumentsClient.SynchronizeWithBank(
		EDFSettingAttributes.Company, EDFSettingAttributes.Counterparty);
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM FIELD EVENT HANDLERS

&AtClient
Procedure ReportTableDetailsProcessing(Item, Details, StandardProcessing)
	
	DetailsObject = Item.CurrentArea.Details;
	If TypeOf(DetailsObject) = Type("CatalogRef.EDAttachedFiles") Then
		StandardProcessing = False;
		ElectronicDocumentsServiceClient.OpenEDForViewing(DetailsObject);
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Parameters.Property("FilterObject", ObjectRef);
	Items.SynchronizeWithBank.Visible = False;
	InitialObject = ObjectRef;
	If ValueIsFilled(ObjectRef) Then
		UpdateEDDependenciesTree();
	EndIf;
	
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	ReportTable.Show();
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "RefreshStateED" Then
		UpdateEDDependenciesTree();
	EndIf;
	
EndProcedure
